In [1]:
data= '{"emp_name":"james","email_id":"james@gmail.com","job_profile":[{"title-1":"team_lead","title-2":"Sr.Datascientist"}]}'

In [2]:
type(data)

str

In [3]:
import pandas as pd

In [4]:
pd.read_json(data) #data should be as string...

  emp_name         email_id                                        job_profile
0    james  james@gmail.com  {'title-1': 'team_lead', 'title-2': 'Sr.Datasc...

In [5]:
pd.read_json(data,orient='records')

  emp_name         email_id                                        job_profile
0    james  james@gmail.com  {'title-1': 'team_lead', 'title-2': 'Sr.Datasc...

In [6]:
pd.read_json(data,orient='index')

                                                             0
emp_name                                                 james
email_id                                       james@gmail.com
job_profile  [{'title-1': 'team_lead', 'title-2': 'Sr.Datas...

In [8]:
pd.read_json(data,orient='columns') #record and columns show same result

  emp_name         email_id                                        job_profile
0    james  james@gmail.com  {'title-1': 'team_lead', 'title-2': 'Sr.Datasc...

In [9]:
df=pd.DataFrame([['a','b'],['c','d']],
               index=['row1','row2'],
               columns=['col 1','col 2'])

In [16]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df

     col 1 col 2
row1     a     b
row2     c     d

In [17]:
df.to_json() #to convert json

'{"col 1":{"row1":"a","row2":"c"},"col 2":{"row1":"b","row2":"d"}}'

In [22]:
df.to_json(orient='index')

'{"row1":{"col 1":"a","col 2":"b"},"row2":{"col 1":"c","col 2":"d"}}'

In [23]:
df.to_json(orient='columns')

'{"col 1":{"row1":"a","row2":"c"},"col 2":{"row1":"b","row2":"d"}}'

In [24]:
df.to_json(orient='records')

'[{"col 1":"a","col 2":"b"},{"col 1":"c","col 2":"d"}]'

In [25]:
df.to_json(orient='split')

'{"columns":["col 1","col 2"],"index":["row1","row2"],"data":[["a","b"],["c","d"]]}'

In [32]:
schema=df.to_json(orient='table')
schema

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col 1","type":"string"},{"name":"col 2","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":"row1","col 1":"a","col 2":"b"},{"index":"row2","col 1":"c","col 2":"d"}]}'

In [33]:
pd.read_json(schema,orient='table')

     col 1 col 2
row1     a     b
row2     c     d

In [35]:
df=pd.read_html('https://en.wikipedia.org/wiki/Hyundai_Motor_Company')
ds=df[2]
ds

  Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]  \
                                                              Rank
0                                                  1
1                                                  2
2                                                  3
3                                                  4
4                                                  5
5                                                  6
6                                                  7
7                                                  8


          Country Vehicleproduction
0     South Korea           1646888
1           India            635413
2           China            360565
3   United States            288967
4  Czech Republic            275620
5          Russia            235157
6          Brazil            188349
7          Turkey            161500

In [36]:
ds1=df[4]
ds1

   Rank                     Model  Global sales
0     1                    Tucson        476834
1     2  Elantra/Avante/i30 Sedan        380907
2     3                Creta/ix25        313693
3     4            i10/Xcent/Aura        245611
4     5         Kona/Encino/Kauai        233170
5     6                  Santa Fe        221230
6     7                     Venue        185720
7     8      Accent/Verna/Solaris        184286
8     9                    Sonata        158361
9    10                  Palisade        157688

In [37]:
hyundai=ds.to_json(orient='index')

In [38]:
hyundai

'{"0":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":1,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"South Korea","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":1646888},"1":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":2,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"India","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":635413},"2":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":3,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"China","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":360565},"3":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":4,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"United States","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":288967},"4":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":5,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Czech Republic","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":275620},"5":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":6,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Russia","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":235157},"6":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":7,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Brazil","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":188349},"7":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":8,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Turkey","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":161500}}'

In [39]:
kaka=[{"0":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":1,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"South Korea","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":1646888},"1":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":2,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"India","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":635413},"2":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":3,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"China","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":360565},"3":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":4,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"United States","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":288967},"4":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":5,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Czech Republic","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":275620},"5":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":6,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Russia","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":235157},"6":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":7,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Brazil","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":188349},"7":{"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Rank\')":8,"(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Country\')":"Turkey","(\'Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]\', \'Vehicleproduction\')":161500}]

In [41]:
pd.read_json(kaka,orient='index')

,"('Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]', 'Rank')","('Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]', 'Country')","('Top 8 Hyundai and Genesis vehicleproduction by country, 2021[46]', 'Vehicleproduction')"
0,1,South Korea,1646888
1,2,India,635413
2,3,China,360565
3,4,United States,288967
4,5,Czech Republic,275620
5,6,Russia,235157
6,7,Brazil,188349
7,8,Turkey,161500

In [ ]:
pd.json_normalize()

In [66]:
ds1.to_json(orient='index')

'{"0":{"Rank":1,"Model":"Tucson","Global sales":476834},"1":{"Rank":2,"Model":"Elantra\\/Avante\\/i30 Sedan","Global sales":380907},"2":{"Rank":3,"Model":"Creta\\/ix25","Global sales":313693},"3":{"Rank":4,"Model":"i10\\/Xcent\\/Aura","Global sales":245611},"4":{"Rank":5,"Model":"Kona\\/Encino\\/Kauai","Global sales":233170},"5":{"Rank":6,"Model":"Santa Fe","Global sales":221230},"6":{"Rank":7,"Model":"Venue","Global sales":185720},"7":{"Rank":8,"Model":"Accent\\/Verna\\/Solaris","Global sales":184286},"8":{"Rank":9,"Model":"Sonata","Global sales":158361},"9":{"Rank":10,"Model":"Palisade","Global sales":157688}}'

In [45]:
mama=[{"0":{"Rank":1,"Model":"Tucson","Global sales":476834},"1":{"Rank":2,"Model":"Elantra\\/Avante\\/i30 Sedan","Global sales":380907},"2":{"Rank":3,"Model":"Creta\\/ix25","Global sales":313693},"3":{"Rank":4,"Model":"i10\\/Xcent\\/Aura","Global sales":245611},"4":{"Rank":5,"Model":"Kona\\/Encino\\/Kauai","Global sales":233170},"5":{"Rank":6,"Model":"Santa Fe","Global sales":221230},"6":{"Rank":7,"Model":"Venue","Global sales":185720},"7":{"Rank":8,"Model":"Accent\\/Verna\\/Solaris","Global sales":184286},"8":{"Rank":9,"Model":"Sonata","Global sales":158361},"9":{"Rank":10,"Model":"Palisade","Global sales":157688}}]

In [46]:
type(mama)

list

In [44]:
pd.read_json(mama,orient='index')

   Rank                     Model  Global sales
0     1                    Tucson        476834
1     2  Elantra/Avante/i30 Sedan        380907
2     3                Creta/ix25        313693
3     4            i10/Xcent/Aura        245611
4     5         Kona/Encino/Kauai        233170
5     6                  Santa Fe        221230
6     7                     Venue        185720
7     8      Accent/Verna/Solaris        184286
8     9                    Sonata        158361
9    10                  Palisade        157688

In [47]:
pd.json_normalize(mama) #nee

,0.Rank,0.Model,0.Global sales,1.Rank,1.Model,1.Global sales,2.Rank,2.Model,2.Global sales,3.Rank,...,6.Global sales,7.Rank,7.Model,7.Global sales,8.Rank,8.Model,8.Global sales,9.Rank,9.Model,9.Global sales
0,1,Tucson,476834,2,Elantra\/Avante\/i30 Sedan,380907,3,Creta\/ix25,313693,4,...,185720,8,Accent\/Verna\/Solaris,184286,9,Sonata,158361,10,Palisade,157688

In [49]:
data1= [{"emp_name":"james","email_id":"james@gmail.com","job_profile":{"title-1":"team_lead","title-2":"Sr.Datascientist"}}]

In [50]:
type(data1)

list

In [52]:
pd.json_normalize(data1)#we need to make list first if its string and rremove nested list

  emp_name         email_id job_profile.title-1 job_profile.title-2
0    james  james@gmail.com           team_lead    Sr.Datascientist

In [59]:
data2=[
    {
        "id"  : 1,
        "name" : "cole volk",
        "fitness" : {"height":130,"weight":60},
    },
    { "name" : "mark reg", "fitness" : {"height":130,"weight":60}},
    {
    "id" : 3,
    "name" : "Faye Raker",
    "fitness" : {"height":130,"weight":60},
    },
]

In [60]:
pd.json_normalize(data2)

    id        name  fitness.height  fitness.weight
0  1.0   cole volk             130              60
1  NaN    mark reg             130              60
2  3.0  Faye Raker             130              60

In [61]:
data2=[
    {
        "id"  : 1,
        "name" : "cole volk",
        "fitness" : {"height":130,"weight":60},
    },
    {"id" :2 ,"name" : "mark reg", "fitness" : {"height":130,"weight":60}},
    {
    "id" : 3,
    "name" : "Faye Raker",
    "fitness" : {"height":130,"weight":60},
    },
]

In [62]:
pd.json_normalize(data2)

   id        name  fitness.height  fitness.weight
0   1   cole volk             130              60
1   2    mark reg             130              60
2   3  Faye Raker             130              60

In [63]:
pd.json_normalize(data2,max_level=0)

   id        name                        fitness
0   1   cole volk  {'height': 130, 'weight': 60}
1   2    mark reg  {'height': 130, 'weight': 60}
2   3  Faye Raker  {'height': 130, 'weight': 60}

In [77]:
dataframe=[
    {
        "state":"Madhyapradesh",
        "shortname":"MP",
        "info" : {"governer":"Mangu Bhai"},
        "district":[
            {'name':'Balaghat','population':567433},
            {'name':'Mandla','population':4356322},
            {'name':'Seoni','population':5432455},
        ],
    },
    {
        'state':'Mharashtra',
        'shortname':'MH',
        'info':{'governer':'Bhagat singh koshyari'},
        "district":[
            {'name':'Nagpur','population':12000432},
            {"name":"Wardha",'population':895432},
            {'name':'Gondia','population':654751}
        ],
    },
]

In [78]:
type(dataframe)

list

In [79]:
pd.json_normalize(dataframe)

,state,shortname,district,info.governer
0,Madhyapradesh,MP,"[{'name': 'Balaghat', 'population': 567433}, {...",Mangu Bhai
1,Mharashtra,MH,"[{'name': 'Nagpur', 'population': 12000432}, {...",Bhagat singh koshyari

In [80]:
pd.json_normalize(dataframe,"district")

       name  population
0  Balaghat      567433
1    Mandla     4356322
2     Seoni     5432455
3    Nagpur    12000432
4    Wardha      895432
5    Gondia      654751

In [81]:
pd.json_normalize(dataframe,"district",["state"])

       name  population          state
0  Balaghat      567433  Madhyapradesh
1    Mandla     4356322  Madhyapradesh
2     Seoni     5432455  Madhyapradesh
3    Nagpur    12000432     Mharashtra
4    Wardha      895432     Mharashtra
5    Gondia      654751     Mharashtra

In [84]:
pd.json_normalize(dataframe,"district",["state","shortname","info"])

,name,population,state,shortname,info
0,Balaghat,567433,Madhyapradesh,MP,{'governer': 'Mangu Bhai'}
1,Mandla,4356322,Madhyapradesh,MP,{'governer': 'Mangu Bhai'}
2,Seoni,5432455,Madhyapradesh,MP,{'governer': 'Mangu Bhai'}
3,Nagpur,12000432,Mharashtra,MH,{'governer': 'Bhagat singh koshyari'}
4,Wardha,895432,Mharashtra,MH,{'governer': 'Bhagat singh koshyari'}
5,Gondia,654751,Mharashtra,MH,{'governer': 'Bhagat singh koshyari'}

In [88]:
pd.json_normalize(dataframe,"district",["state","shortname",["info","governer"]])

       name  population          state shortname          info.governer
0  Balaghat      567433  Madhyapradesh        MP             Mangu Bhai
1    Mandla     4356322  Madhyapradesh        MP             Mangu Bhai
2     Seoni     5432455  Madhyapradesh        MP             Mangu Bhai
3    Nagpur    12000432     Mharashtra        MH  Bhagat singh koshyari
4    Wardha      895432     Mharashtra        MH  Bhagat singh koshyari
5    Gondia      654751     Mharashtra        MH  Bhagat singh koshyari